{
    "HEADER": {
        "ABOUT": "About",
        "SKILLS": "Skills",
        "WORK": "Experiences",
        "PROJECT": "Projects",
        "CONTACT": "Contacts",
        "CV": "CV"
    },
    "PAGES": {
        "HOME": {
            "SHORT_DESCR": "",
            "LONG_DESCR": "Self-taught programmer motivated by passion and personal projects. Expert of searching bugs on Google and quickly scanning the best StackOverflow answers.",
            "DYNAMIC": {
                "TEXT_1": "CODE WIZARD",
                "TEXT_2": "SOFTWARE ENGINEER",
                "TEXT_3": "EXPERT AI USER"
            },
            "CONTACT_ME": "Contact me",
            "LEARN": "Learn more"
        },
        "ABOUT": {
            "TITLE": "ABOUT",
            "SHORT_DESCR": "Software engineer with over 7 years of experience. Full time wizard & proud bug developer.",
            "LONG_DESCR" : "Passionate about computer science since childhood. I've spent over 5 years refining my skills through diverse projects. Ever since I was 9 years old, I've loved computer science. This interest has grown into a full career where I keep learning and staying up-to-date with technology. I like to learn by doing, not watching tutorials. Over the years, I have independently developed numerous open-source projects to experiment with a wide range of technologies."
        },
        "CONTACT": {
            "TITLE": "CONTACTS",
            "EMAIL": "Your email",
            "EMAIL_VALID": "Insert a valid email",
            "SUBJECT": "Subject",
            "SUBJECT_MANDATORY": "Subject is mandatory",
            "MESSAGE": "Message",
            "MESSAGE_MANDATORY": "Message is mandatory",
            "SEND": "Send"
        },
        "EXPERIENCE": {
            "TITLE": "EXPERIENCES",
            "LONG_DESCR": "I had the opportunity to work for several companies using different technologies, from small startups to bigger companies. Each experience taught me something and I continuously improved in my learning journey."
        },
        "PROJECTS": {
            "TITLE": "PROJECTS",
            "SHORT_DESCR": "Experiences",
            "LONG_DESCR": ""
        },
        "SKILLS": {
            "TITLE": "SKILLS",
            "LONG_DESCR" : "I excel in dissecting complex problems into manageable tasks, essential for crafting robust, maintainable code in large-scale projects. I'm driven by challenges, always seeking opportunities to enhance my skills. My self-directed learning approach empowers me to quickly grasp and adapt to new technologies autonomously."
        }
    }
}